[{"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/old-age-security/guaranteed-income-supplement/allowance-survivor/eligibility.html", "text": "Allowance for the Survivor: Do you qualify\nAllowance for the Survivor\nOverview Overview\nDo you qualify\nHow much you could receive How much you could receive\nYour application Your application\nWhile receiving the Allowance for the Survivor While receiving the Allowance for the Survivor\nDo you qualify\nThe information provided below should be used as a guideline. We encourage you to apply and allow a Service Canada representative to determine if you are eligible.\nDo you qualify for the Allowance for the Survivor\nYou may be able to get the Allowance for the Survivor benefit if:\nyour spouse or common-law partner has died and since their death you have not remarried or entered into a common-law relationship\nyou are 60 to 64 years of age\nyou are a Canadian Citizen or a legal resident\nyou have resided in Canada for at least 10 years since the age of 18\nyour annual income is less than $28,080\nCheck the maximum annual income threshold.\nIf you have not resided in Canada for at least 10 years since you turned 18, but you have resided or worked in a country that has a social security agreement with Canada, you may still be eligible for a partial benefit.\nOther circumstances\nIf you are an immigrant who is sponsored\nIf you are a sponsored immigrant and have lived in Canada for less than 10 years after age 18, you can apply and have your benefit approved however, you will not receive a payment for the Allowance for the Survivor while you are sponsored unless your sponsor:\nsuffers personal bankruptcy\nis sentenced to a term of incarceration for more than 6 months\nis convicted of an offence against you under the Criminal Code\ndies\nIf you have lived in Canada for fewer than 10 years since you turned 18, but you have lived or worked in a country that has a social security agreement with Canada, you may be eligible for a partial benefit.\nIf you become entitled to the Allowance for the Survivor, it will gradually increase with every year that you continue to reside in Canada until you have reached 10 years of residence.\nIf you are an immigrant who is not sponsored\nIf you are an immigrant who is not sponsored, you may be eligible to receive the Allowance for the Survivor based on the number of years you have resided in Canada after age 18.\nIf you have lived in Canada for fewer than 10 years since you turned 18, but you have lived or worked in a country that has a social security agreement with Canada, you may be eligible for a partial benefit.\nYour Allowance for the Survivor entitlement will gradually increase with every year that you continue to reside in Canada until you have reached 10 years of residence.\nIf you are in jail\nIf you are in jail in a Federal institution, you can apply for the Allowance for the Survivor however, you cannot receive a payment until you are released.\nDocument navigation\nPrevious - Overview\nNext - How much could you receive\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-03-31"}, {"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/cpp-international/eligibility.html", "text": "Lived or living outside Canada- Pension and benefits - Eligibility\nLived or living outside Canada - Pensions and benefits\nOverview Overview\nEligibility\nHow much could you receive How much could you receive\nWhat you need before you start What you need before you start\nApply Apply\nWhile on pension and benefits While on pension and benefits\nEligibility\nHow can a social security agreement help me qualify for benefits?\nA social security agreement can help you qualify for benefits by allowing you to combine your periods of contribution or periods of residency in Canada with your periods of contribution or periods of residency in the other country to meet the minimum eligibility criteria. It can also reduce or eliminate restrictions based on citizenship or on payment of pensions abroad.\nNote: Possible eligibility for more than one benefit\nYou may be eligible for a foreign pension, a Canadian pension, or both.\nCanadian benefits\nIf you have lived and/or worked in Canada and in another country, and do not meet the contributory\nor residence requirement for a Canada Pension Plan or Old Age Security benefit, a social security agreement may help you qualify. It might also provide benefits to your surviving spouse, common law partner or children.\nThe Canadian benefits included in Canada’s international social security agreements are those paid under the Old Age Security program and the Canada Pension Plan program.\nA social security agreement may help you qualify for a Canadian or foreign benefit, or both, if you lived or worked abroad and in Canada.\nTo help you qualify for a Canadian pension or benefit:\nyour periods of contribution under the legislation of another country may be considered as periods of contribution to the Canada Pension Plan (CPP).\nyour periods of residency and contribution under the legislation of another country, also known as creditable periods, may be considered as periods of residency in Canada for the Old Age Security (OAS) program depending on the agreement.\nExample 1\nThomas, 65, lived in Austria for much of his life. He lived in Canada for 16 years after the age of 18. This year, he moved back to Austria to be nearer his aging parents. Normally 20 years of residence in Canada is needed to receive an OAS pension outside Canada, so Thomas would normally not have qualified. However, the social security agreement with Austria allows him to count the time he lived in Austria after age 18 towards meeting the 20 -year residence-in-Canada requirement. Thomas will receive a partial OAS pension outside Canada for the rest of his life.\nNote that while the social security agreement helped qualify Thomas to receive an OAS pension, the payment amount is determined by the numbers of years of residence in Canada after age 18. Having lived in Canada for 16 years, Thomas will receive 16/40ths of the full OAS pension.\nExample 2\nLiam was born in Ireland and worked there for 20 years before moving to Canada at the age of 40. Liam worked in Canada and contributed to the CPP for 5 years prior to his death at age 46. For Liam’s spouse and child to be eligible for CPP death and survivor benefits, Liam needed to have contributed to the CPP for 10 years. (You have to contribute to the CPP for at least one-third of all the years of your “contributory period”.) Because Liam contributed to the CPP for only 5 years, his survivors would normally not be entitled to death or survivor benefits. However, the social security agreement with Ireland allows his periods of contribution to the Irish pension program to be considered as periods of contribution to the CPP in order to satisfy the minimum qualifying period of 10 years. Since Liam’s spouse and child meet the age requirements, they will be entitled to CPP death and survivor benefits.\nNote that, while the social security agreement helped Liam’s spouse and child to qualify for CPP benefits, the payment amounts will be based on the actual contributions Liam made to the CPP.\nForeign benefits\nThe foreign benefits covered by Canada’s international social security agreements vary from agreement to agreement. It is important to check the details of the agreement that relates to you.\nTo help you qualify for a foreign pension or benefit:\nyour periods of contribution to the Canada Pension Plan or periods of residence in Canada may be considered as periods of contribution or residence under a foreign social security program.\nExample 3\nChristine, from Winnipeg, lived in Canada until she was 30 when she accepted a job at an international engineering firm in Barbados. She worked there for 7 years and then decided to return to Canada. Because she did not contribute to the Barbadian social security scheme for the minimum period of time, she would normally not qualify for a Barbadian retirement pension. So her contributions to the Barbadian pension plan would have been lost. However, Canada’s social security agreement with Barbados allows her to combine her periods of contribution to the Canada Pension Plan with her periods of contribution to the Barbadian social security scheme in order to meet the minimum requirement. Later, when she is ready to apply for her Barbadian pension, it will be based on those 7 years of contributions to the Barbadian social security scheme.\n(And, when she is ready to apply for her Canada Pension Plan retirement pension, it will be based on her years of contributions to the CPP. Her Canadian Old Age Security pension will be based on her years of residence in Canada after the age of 18.)\nDocument navigation\nPrevious - Overview\nNext - How much could you receive\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-06-02"}, {"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/old-age-security/guaranteed-income-supplement/allowance/eligibility.html", "text": "Allowance: Do you qualify\nGuaranteed Income Supplement - Allowance\nOverview Overview\nDo you qualify\nHow much you could receive How much you could receive\nApply Apply\nWhile receiving the Allowance While receiving the Allowance\nDo you qualify\nThe information provided below should be used as a guideline. We encourage you to apply and allow a Service Canada representative to determine if you are eligible.\nDo you qualify for the Allowance\nYou may be able to get the Allowance benefit if:\nyour spouse or common-law partner receives an Old Age Security pension (OAS) and is eligible and entitled to receive the Guaranteed Income Supplement (GIS)\nyou are 60 to 64 years of age\nyou are a Canadian citizen or a legal resident\nyou have resided in Canada for at least 10 years since the age of 18\nyou and your spouse or common-law partner’s annual combined income is less than $38,592\nCheck the maximum annual income threshold.\nIf you have not resided in Canada for at least 10 years since you turned 18, but you have resided or worked in a country that has a social security agreement with Canada, you may still be eligible for a partial benefit.\nOther circumstances\nIf you are an immigrant who is sponsored\nIf you are a sponsored immigrant and have lived in Canada for less than 10 years after age 18, you can apply and have your benefit approved however, you will not receive a payment for the Allowance while you are sponsored unless your sponsor:\nsuffers personal bankruptcy\nis sentenced to a term of incarceration for more than 6 months\nis convicted of an offence against you under the Criminal Code\ndies\nIf you have lived in Canada for fewer than 10 years since you turned 18, but you have lived or worked in a country that has a social security agreement with Canada, you may be eligible for a partial benefit.\nIf you become entitled to the Allowance it will gradually increase with every year that you continue to reside in Canada until you have reached 10 years of residence.\nIf you are an immigrant who is not sponsored\nIf you are an immigrant who is not sponsored, you may be eligible to receive the Allowance based on the number of years you have resided in Canada after age 18.\nIf you have lived in Canada for fewer than 10 years since you turned 18, but you have lived or worked in a country that has a social security agreement with Canada, you may be eligible for a partial benefit.\nYour Allowance or the Allowance for the Survivor entitlement will gradually increase with every year that you continue to reside in Canada until you have reached 10 years of residence.\nIf your spouse or common-law partner is in jail\nYou may be entitled to the Allowance if your spouse or common-law partner is in jail, provided that you meet all the eligibility requirements. The Allowance will be based on your own annual income.\nIf your spouse or common-law partner is in jail, he or she must be in receipt or apply for the Old Age Security or Guaranteed Income Supplement and be found eligible in order for you to be eligible to receive the Allowance.\nIf you are in jail\nIf you are in jail in a Federal institution, you can apply for the Allowance however, you cannot receive a payment until you are released.\nDocument navigation\nPrevious : Overview\nNext : How much you could receive\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-03-31"}, {"url": "https://www.canada.ca/en/revenue-agency/services/child-family-benefits/gsthstc-eligibility.html", "text": "GST/HST credit – Eligibility\n1. Overview\n2. Eligibility\n3. Apply\n4. How much you can expect to receive\n5. Payment dates\nEligibility\nYou are generally eligible for the GST/HST credit if you are considered a Canadian resident for income tax purposes the month before and at the beginning of the month in which the Canada Revenue Agency makes a payment. You also need to meet one of the following criteria:\nyou are at least 19 years old\nyou have (or had) a spouse or common-law partner\nyou are (or were) a parent and live (or lived) with your child\nParents in a shared custody situation may be eligible for half of the GST/HST credit for that child. This also applies to any related provincial and territorial credit. Go to Custody arrangements and your benefits for more information.\nIf, however, a child welfare agency is legally, physically, or financially responsible for a child, you are not generally eligible for the GST/HST credit for that child.\nLeaving an abusive or violent situation? Get benefit and credit payments without putting yourself, or your family, in danger. For more information, go to Getting benefits and credits when in an abusive or violent situation.\nRelated information\nGST/HST credit guide\nChild and family benefits calculator\nMyAccount\nMyBenefits CRA - mobile app\nValidating your eligibility for benefits and credits\nDirect deposit\nBenefit and credit payment dates reminders\nGST/HST credit: calculation sheets\nGST/HST credit payments chart\nDocument navigation\nPrevious - GST/HST credit - Overview\nNext - GST/HST credit – Apply\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2021-12-15"}, {"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/old-age-security/guaranteed-income-supplement/eligibility.html", "text": "Guaranteed Income Supplement: Do you qualify\nGuaranteed Income Supplement\nOverview Overview\nDo you qualify\nHow much you could receive How much you could receive\nYour application Your application\nWhile receiving GIS While receiving GIS\nDo you qualify\nThe information provided below should be used as a guideline. We encourage you to allow a Service Canada representative to determine if you are eligible.\nDo you qualify for the Guaranteed Income Supplement\nYou may be able to get this benefit if:\nyou are 65 or older\nyou live in Canada\nyou receive the Old Age Security (OAS) pension\nyour income is below $20,832 if you are single, widowed, or divorced\nyour income plus the income of your spouse/common-law partner is below:\n$27,552 if your spouse/common-law partner receives the full OAS pension\n$49,920 if your spouse/common-law partner does not receive an OAS pension\n$38,592 if your spouse/common-law partner receives the Allowance\nIf you moved to Canada as an immigrant\nIf you are an immigrant who is sponsored\nIf you are a sponsored immigrant and have lived in Canada for less than 10 years after age 18, you cannot receive the Guaranteed Income Supplement while you are sponsored unless your sponsor:\nsuffers personal bankruptcy\nis imprisoned for more than 6 months\nis convicted of abusing you\ndies\nIf you are an immigrant who is not sponsored\nIf you are an immigrant who is not sponsored, you could receive the Guaranteed Income Supplement if you receive the Old Age Security pension.\nDocument navigation\nPrevious : Overview\nNext : How much you could receive\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-03-31"}, {"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/cpp-disability-benefit/eligibility.html", "text": "Canada Pension Plan disability benefits: Do you qualify\nCanada Pension Plan disability benefits\nOverview Overview\nDo you qualify\nHow much could you receive How much could you receive\nApply Apply\nAfter you apply After you apply\nInformation for health care professionals Information for health care professionals\nDo you qualify\nThe information provided below should be used as a guideline. We encourage you to apply for Canada Pension Plan (CPP) benefits and allow a Service Canada representative to determine if you are eligible. Learn how we assess applications for the disability benefit.\nDo you qualify for a disability or children’s benefit\nCPP disability benefit\nThe disability benefit is a monthly payment you can get if you:\nare under 65\ncontributed enough to the Canada Pension Plan\nhave a mental or physical disability that regularly stops you from doing any type of substantially gainful work\nhave a disability that is long-term and of indefinite duration, or is likely to result in death\nCPP post-retirement disability benefit\nIf you currently get the monthly CPP retirement pension, you could receive the Canada Pension Plan post-retirement disability benefit if you:\nare 60 to 65\ncontributed enough to the CPP\nhave a mental or physical disability that regularly stops you from doing any type of substantially gainful work\nhave a disability that is long-term and of indefinite duration, or is likely to result in death\nhave been receiving the CPP retirement pension for more than 15 months or become disabled after starting to receive the retirement pension\nCPP Children’s benefit\nIf you are getting a disability benefit, any of your dependent children can get a monthly payment if they are:\nunder 18, or\nbetween 18 and 25 and attending school full time\nFind out more about the CPP Children’s benefit.\nOther circumstances\nIf you live in Quebec\nIf you live in Quebec, you would not apply for the disability benefit under the Canada Pension Plan. You can apply for the Quebec Pension Plan disability benefit if one of the following applies to you:\nyou have worked only in the province of Quebec\nyou currently live in Quebec and have worked both in the province of Quebec and in another province or territory\nyou have worked in Quebec, currently live outside Canada and your last province of residence was Quebec\nIf you worked both in and outside Quebec\nIf you paid into both the Canada Pension Plan and Quebec Pension Plan, you need to apply to the province where you live now.\nIf you worked outside Canada\nIf you worked in a country other than Canada, the credits you earned in that country may help you qualify for the disability benefit.\nIf you worked less to care for young children\nIf you have periods of zero or low income because you stayed home to raise your children, the child-rearing provision could help you qualify for the disability benefit.\nIf you are divorced or separated\nAny contributions you and your spouse or common-law partner made to the CPP while you lived together may be equally divided after a divorce or a separation. This may help you qualify for the disability benefit. Find out more about credit splitting for divorced or separated couples.\nIf you missed applying for disability benefits in the past\nIf you are applying for the disability benefit, but stopped working a while ago, you may still apply for a benefit now.\nYou may be able to receive the benefit if:\nyou had contributed enough years to the Canada Pension Plan before you first became severely disabled\nyou have been continuously disabled from that date up to now\nIf you are in this situation, contact us.\nIf you were incapacitated\nIf you are or were incapable of forming or expressing an intention to make an application, contact us.\nDocument navigation\nPrevious - Overview\nNext - How much could you receive\nPage feedback\nDid you find what you were looking for?\nYes Yes No\nIf not, tell us why below:\nWhat was wrong?\nI can't find the information\nThe information is hard to understand\nThere was an error or something didn't work\nOther reason\nPlease provide more details (maximum 300 characters)\nYou will not receive a reply. Telephone numbers and email addresses will be removed.\nSubmit\nThank you for your feedback.\nDate modified:\n2022-04-07"}, {"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/old-age-security/eligibility.html", "text": "Old Age Security: Do you qualify\nOld Age Security\nOverview Overview\nDo you qualify\nHow much you could receive How much you could receive\nYour application Your application\nWhile receiving OAS While receiving OAS\nDo you qualify\nYour employment history is not a factor in determining eligibility. You can receive the Old Age Security (OAS) pension even if you have never worked or are still working.\nIf you are living in Canada, you must:\nbe 65 years old or older\nbe a Canadian citizen or a legal resident at the time we approve your OAS pension application\nhave resided in Canada for at least 10 years since the age of 18\nIf you are living outside Canada, you must:\nbe 65 years old or older\nhave been a Canadian citizen or a legal resident of Canada on the day before you left Canada\nhave resided in Canada for at least 20 years since the age of 18\nCanadians working outside Canada for Canadian employers\nCanadians working outside Canada for Canadian employers, such as the Canadian Armed Forces and banks, may have their time working abroad counted as residence in Canada.\nTo qualify this time working abroad as residence, you must have either:\nreturned to Canada within 6 months of ending employment\nturned 65 years old while still employed and maintained residence in Canada during your time outside of Canada\nYou must provide the following 2 documents:\nproof of employment from the employer\nproof of physically returning to Canada (unless you turned 65 while still employed outside Canada).\nUnder certain conditions, spouses, common-law partners, dependents, and Canadians working abroad for international organizations may also count time spent abroad as residence in Canada.\nIf neither of the above scenarios applies to you, you may still qualify for the Old Age Security pension, a pension from another country, or from both countries if you have:\nlived in one of the countries Canada has established a social security agreement\nor\ncontributed to the social security system of one of the countries with which Canada has established a social security agreement.\nFor more information, see lived or living outside Canada.\nDocument navigation\nPrevious: Overview\nNext: How much you could receive\nPage feedback\nDid you find what you were looking for?\nYes Yes No\nIf not, tell us why below:\nWhat was wrong?\nI can't find the information\nThe information is hard to understand\nThere was an error or something didn't work\nOther reason\nPlease provide more details (maximum 300 characters)\nYou will not receive a reply. Telephone numbers and email addresses will be removed.\nSubmit\nThank you for your feedback.\nDate modified:\n2022-04-07"}, {"url": "https://www.canada.ca/en/services/benefits/publicpensions/cpp/cpp-benefit/eligibility.html", "text": "CPP retirement pension: Do you qualify\n{ &#13; &#13; \"@context\":\"http://schema.org/\",&#13; \"@type\": \"WebPage\",&#13; \"image\":\"https://www.canada.ca/content/dam/canada/social-media/canada.png\",&#13; \"name\": \"CPP retirement pension: Do you qualify\",&#13; \"description\": \"You can apply for and receive a full CPP retirement pension at age 65 or receive it as early as age 60 with a reduction, or as late as age 70 with an increase.\",&#13; \"keywords\":\"Canada Pension Plan, Apply CPP, public pension, eligibility\",&#13; \"url\":\"https://www.canada.ca/en/services/benefits/publicpensions/cpp/cpp-benefit/eligibility.html\"}&#13; &#13;\nCPP Retirement pension\nOverview Overview\nDo you qualify\nWhen to start your retirement pension When to start your retirement pension\nHow much you could receive How much you could receive\nApply Apply\nAfter you apply After you apply\nOther CPP benefits Other CPP benefits\nMore information More information\nDo you qualify\nTo qualify for a Canada Pension Plan (CPP) retirement pension, you must:\nbe at least 60 years old\nhave made at least one valid contribution to the CPP\nValid contributions can be either from work you did in Canada, or as the result of receiving credits from a former spouse or former common-law partner at the end of the relationship.\nWorking while on the CPP retirement pension\nYou can still work if you are receiving a CPP retirement pension, without reducing the pension amount. In fact, you could increase it by means of the CPP post-retirement benefit.\nIf you work while receiving your CPP retirement pension and are under age 70, you can still make CPP contributions. Each year you contribute to the CPP will result in a post-retirement benefit and increase your retirement income. We will automatically pay you this benefit the following year. You’ll receive it for the rest of your life.\nYou can choose to stop your post-retirement contributions when you reach age 65. Your CPP contributions will stop when you reach 70 years of age, even if you’re still working.\nOther circumstances\nIf you lived and worked in Quebec\nThe CPP and Québec Pension Plan (QPP) work together to make sure that all contributors receive a retirement pension. Contact Retraite Québec if one of the following applies to you:\nyou’ve only worked in Quebec\nyou worked in Quebec and in at least one other province/territory, and are living in Quebec\nyou’ve worked in Quebec, currently live outside Canada and your last province of residence was Quebec\nIf you lived and worked in another country\nIf you lived and worked in Canada and in another country, you may qualify to receive both a CPP retirement pension and a pension from the other country. Canada has international social security agreements with a number of countries.\nIf you die before starting CPP retirement pension\nIf you’re under 70 and you die before applying for your CPP retirement pension, it can’t be paid to anyone else. If you’re over 70, your estate can submit an application no later than one year after your death. Your estate will receive up to 11 months of retirement pension. Your family may also qualify for other CPP benefits.\nDocument navigation\nPrevious: Overview\nNext: When to start your retirement pension\nPage feedback\nDid you find what you were looking for?\nYes Yes No\nIf not, tell us why below:\nWhat was wrong?\nI can't find the information\nThe information is hard to understand\nThere was an error or something didn't work\nOther reason\nPlease provide more details (maximum 300 characters)\nYou will not receive a reply. Telephone numbers and email addresses will be removed.\nSubmit\nThank you for your feedback.\nDate modified:\n2022-04-07"}, {"url": "https://www.canada.ca/en/services/benefits/ei/ei-regular-benefit/eligibility.html", "text": "EI regular benefits: Do you qualify\n\nEI regular benefits\nDo you qualify\nHow much you could receive How much you could receive\nApply Apply\nAfter you apply After you apply\nWhile on EI While on EI\nDo you qualify\nFrom: Employment and Social Development Canada\nOn this page\nEligibility for specific work situations\nYou may not be eligible for EI benefits\nIf you're in jail\nYou need at least 420 hours of insurable employment to qualify for EI\nFind other types of benefits\nThe information below should be used as a guideline. We encourage you to apply for Employment Insurance (EI) benefits as soon as possible and let us determine if you're eligible.\nYou need to demonstrate that you:\nwere employed in insurable employment\nlost your job through no fault of your own\nare affected by flooding or wildfires\nhave been without work and without pay for at least 7 consecutive days in the last 52 weeks\nhave worked for the required number of insurable employment hours in the last 52 weeks or since the start of your last EI claim, whichever is shorter\nare ready, willing and capable of working each day\nare actively looking for work (you must keep a written record of employers you contact, including when you contacted them)\nTo prove your eligibility and to receive payments you may be entitled to, you're required to complete bi-weekly reports by internet or telephone. Failure to do so can mean a loss of benefits.\nEligibility for specific work situations\nYou may still qualify for benefits, even if you work for an employer who is related to you.\nRefer to the following links for eligibility information for these specific situations:\nEI Benefits and farmers\nEI Benefits and fishers\nEI Benefits and teachers\nEI Benefits and Canadian Force Members\nSpecial benefits for self-employed people\nEI Benefits for workers and residents outside of Canada\nYou may not be eligible for EI benefits\nif you voluntarily left your job without just cause\nif you were dismissed for misconduct\nif you're unemployed because you're directly participating in a labour dispute (for example, a strike, lockout or other type of conflict)\nduring a period of leave that compensates for a period in which you worked under an agreement with your employer, more hours than are normally worked in full-time employment\nCOVID-19 vaccination\nIn most cases, if you lose or quit your job because you didn't comply with your employer's mandatory COVID-19 vaccination policy, you won't be eligible for EI regular benefits. To determine if you're eligible, we may contact you to obtain information such as:\nif your employer clearly communicated a mandatory COVID‑19 vaccination policy to you\nif you were informed that not complying with the policy would result in you losing your employment\nif applying the policy to you was reasonable within your workplace context\nif you have a valid reason for not complying with the policy and your employer didn't provide you an exemption\nWe'll use the facts provided by you and your employer to determine if you're entitled to benefits.\nIf you're in jail\nYou're not entitled to receive EI benefits while you're confined to a jail, penitentiary or other similar institution.\nIf you've been incarcerated but are later found not guilty by a court of law on all counts in relation to the event that led to your incarceration, your qualifying period and benefit period may be extended upon providing necessary proof.\nOnce you've applied for EI benefits, you'll be asked to provide us with proof that you were confined to a jail, penitentiary or other similar institution and that you were not found guilty of the offence(s) from the event(s) for which you were being held.\nFor a qualifying period or benefit period to be extended, you'll be asked to submit the following documents:\na letter from the institution where you were incarcerated, specifying the dates of your incarceration\ndocumentation showing that no other outstanding charge(s) in relation to the event(s) that originally led to the incarceration exist, to confirm the time served is not being credited to any other charge(s) in relation to the original event or any other subsequent event\nproof that you have not been found guilty of the charge(s) from the original event that led to your incarceration\nKeep these documents in a safe place. We'll contact you and provide you with instructions on how to submit them.\nYou need at least 420 hours of insurable employment to qualify for EI\nNumber of hours of insurable employment required to qualify for EI\nThe qualifying period is the shorter of:\nthe 52-week period immediately before the start date of your claim, or\nthe period from the start of a previous benefit period to the start of your new benefit period, if you applied for benefits earlier and your application was approved in the last 52 weeks\nException: In some cases, the qualifying period may be extended to a maximum of 104 weeks if you weren’t employed in insurable employment or if you weren’t receiving EI benefits.\nBased on the unemployment rate in your area, you'll need between 420 and 700 hours of insurable employment during the qualifying period to qualify for regular benefits.\nThe unemployment rate in your area determines how many hours you need to qualify\nOnce you have determined the unemployment rate in your area, see the table below for the number of hours required.\nLook up EI Economic Region by Postal Code to find out the unemployment rate in your region and the number of hours to qualify for regular benefits.\nIf you received a notice of violation regarding prior EI benefit periods, the number of insurable hours required to qualify is increased.\nThe number of hours is shown in the following table:\nNumber of insurable hours required to qualify for EI benefits\nNumber of insurable hours required to qualify for EI benefits\nRegional rate of unemployment\nWithout violation\nMinor violation\nSerious violation\nVery serious violation\nSubsequent violation\n6% and under\n700\n875\n1,050\n1,225\n1,400\n6.1% to 7%\n665\n831\n998\n1,164\n1,330\n7.1% to 8%\n630\n788\n945\n1,103\n1,260\n8.1% to 9%\n595\n744\n893\n1,041\n1,190\n9.1% to 10%\n560\n700\n840\n980\n1,120\n10.1% to 11%\n525\n656\n788\n919\n1,050\n11.1% to 12%\n490\n613\n735\n858\n980\n12.1% to 13%\n455\n569\n683\n796\n910\nMore than 13%\n420\n525\n630\n735\n840\nFind other types of benefits\nAre EI regular benefits not applicable to you? Use the Benefits Finder to find other Government of Canada, provincial, or territorial benefits.\nRelated links\nSubmitting EI reports\nChecklist: Employment Insurance regular benefits application\nMy Service Canada Account\nJob Bank\nDirect deposit\nBenefits finder\nFind a job\nContact us\nEI Contact information - Individuals\nDocument navigation\nPrevious - What these benefits offer\nNext - How much you could receive\nPage feedback\nDid you find what you were looking for?\nYes Yes No\nIf not, tell us why below:\nWhat was wrong?\nI can't find the information\nThe information is hard to understand\nThere was an error or something didn't work\nOther reason\nPlease provide more details (maximum 300 characters)\nYou will not receive a reply. Telephone numbers and email addresses will be removed.\nSubmit\nThank you for your feedback.\nDate modified:\n2022-12-28"}, {"url": "https://www.canada.ca/en/revenue-agency/services/child-family-benefits/witb-eligibility.html", "text": "Canada workers benefit – Eligibility\n1. Overview\n2. Eligibility\n3. Claim and apply\n4. How much you can expect to receive\nEligibility\nYou are eligible for the Canada workers benefit (CWB) if you:\nearn working income\nare a resident of Canada throughout the year\nare 19 years of age or older on December 31, or you live with your spouse or common-law partner or your child\nYou are not eligible for the CWB if you:\nare enrolled as a full-time student at a designated educational institution for more than 13 weeks in the year unless, on December 31, you have an eligible dependant\nare confined to a prison or similar institution for a period of at least 90 days during the year\ndo not have to pay tax in Canada because you are an officer or servant of another country, such as a diplomat, or you are a family member or employee of that person\nFor CWB purposes, an eligible spouse:\nlives with you as your spouse or common-law partner on December 31\nis a resident of Canada throughout the year\nYour spouse or common-law partner is not an eligible spouse for the CWB purposes, if they:\nare enrolled as a full-time student at a designated educational institution for more than 13 weeks in the year unless, on December 31, they have an eligible dependant\nare confined to a prison or similar institution for a period of at least 90 days during the year\ndo not have to pay tax in Canada because they are an officer or servant of another country, such as a diplomat, or are a family member or employee of such a person\nFor CWB purposes, an eligible dependant:\nis your or your spouse's or common-law partner's child\nis under 19 years of age and lives with you on December 31\nis not eligible for the CWB\nDisability supplement\nYou may be eligible for the disability supplement if:\nyou are eligible for the disability tax credit and have an approved Form T2201, Disability Tax Credit Certificate, on file with the Canada Revenue Agency\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-12-09"}, {"url": "https://www.canada.ca/en/services/benefits/ei/ei-sickness/qualify.html", "text": "EI sickness benefits: Do you qualify\nEI sickness benefits\nWhat these benefits offer What these benefits offer\nDo you qualify\nHow much you could receive How much you could receive\nApply Apply\nAfter you apply After you apply\nDo you qualify\nThe information below should be used as a guideline. We encourage you to apply for benefits as soon as possible and let us determine if you're eligible.\nYou need to demonstrate that:\nyou're unable to work for medical reasons\nyour regular weekly earnings from work have decreased by more than 40% for at least 1 week\nyou accumulated 600 insured hours of work in the 52 weeks before the start of your claim or since the start of your last claim, whichever is shorter\nWhile you’re receiving sickness benefits, you must remain otherwise available for work, if it weren’t for your medical condition.\nIf you had a recent claim\nIf you received Employment Insurance benefits in the past 52 weeks, you may not be eligible to receive the maximum number of weeks of sickness benefits.\nHowever, if you've worked enough hours since your last claim, you may be able to start a new claim. Contact us to find out what's best for your situation.\nGet a medical certificate\nYou need to get a medical certificate signed by a medical practitioner when you apply for sickness benefits.\nYou have 2 options. You can ask your medical practitioner to complete and sign one of the following:\nService Canada’s Medical certificate for Employment Insurance sickness benefits or\ntheir own medical certificate form. This certificate must:\nbe readable\ncontain your medical practitioner’s letterhead or official stamp\nindicate your name\ncontain the start date and expected duration (if known) of your incapacity due to illness, injury or quarantine\ncontain your medical practitioner’s handwritten, electronic or stamped signature\nWho can complete and sign your medical certificate\nHere is a list of medical practitioners who can complete and sign your medical certificate. They must practise in Canada or the United States and the illness they’re treating must be in their field.\nmedical doctor\nchiropractor\noptometrist\npsychologist\ndentist\nmidwife (except Prince Edward Island)\nnurse practitioner\nregistered nurse (in isolated areas when a doctor is unavailable)\nOnce you have your medical certificate, keep it in a safe place. We’ll let you know if you need to submit it to Service Canada. Keep it for 6 years in case we require it later.\nDocument navigation\nPrevious: Previous\nNext:Next\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2023-01-06"}, {"url": "https://www.canada.ca/en/services/benefits/ei/caregiving/eligibility.html", "text": "Do you qualify\nEI caregiving benefits\nWhat these benefits offer What these benefits offer\nDo you qualify\nApply Apply\nAfter you apply After you apply\nInformation for medical professionals Information for medical professionals\nDo you qualify\nThe information below should be used as a guideline. We encourage you to apply for benefits as soon as possible and let us determine if you’re eligible.\nYou need to demonstrate that:\nyou’re a family member of the person who is critically ill or injured or needing end-of-life care, or you’re considered to be like a family member\nyour regular weekly earnings from work have decreased by more than 40% for at least 1 week because you need to take time away from work to provide care or support to the person\nyou accumulated at least 600 insured hours of work in the 52 weeks before the start of your claim, or since the start of your last claim, whichever is shorter\na medical doctor or nurse practitioner has certified that the person you are providing care or support to is critically ill or injured or needing end-of-life care\nIf you’re not a family member\nIf you’re not a family member, either the person needing care or support or their legal representative must complete an attestation form to confirm that they consider you to be like family. For a child, the parent or legal guardian must sign the form to confirm.\nAttestation form\nIf the person you’re caring for lives outside Canada\nIf you leave Canada to provide care or support to a person who is critically ill or injured or needing end-of-life care, you may still be eligible to receive these benefits. You must submit an application and supporting documents with the same type of proof that is required for someone living in Canada.\nThe medical certificate for the person who is critically ill or injured or needing end-of-life care should be completed by a medical doctor or nurse practitioner in the country where they’re receiving care.\nDocument navigation\nPrevious : What these benefits offer\nNext: Apply\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-11-25"}, {"url": "https://www.canada.ca/en/services/benefits/ei/ei-fishing/eligibility.html", "text": "EI fishing benefits – Eligibility\nEI fishing benefits\nWhat these benefits offerWhat these benefits offer\nDo you qualify\nHow much you could receiveHow much you could receive\nApplyApply\nAfter you applyAfter you apply\nDo you qualify\nYour eligibility depends on how much you earned from self-employment in fishing during your qualifying period.\nThe qualifying period for summer fishing benefits can't start earlier than the week of March 1. For winter fishing benefits, it can't start earlier than the week of September 1. The qualifying period also can't start more than 31 weeks immediately before the start of a benefit period.\nIf you applied for benefits earlier and your application was approved in the last 31 weeks, the qualifying period is from the start of the previous benefit period to the start of your new benefit period.\nTo qualify for Employment Insurance (EI) fishing benefits, the amount you need to earn during your qualifying period varies depending on the unemployment rate in the region where you live. As Table 1 shows, you need to earn a minimum of between $2,500 and $4,200 during your qualifying period.\nTo qualify for EI special benefits (sickness, maternity, parental and caregiving), you must earn $3,760 or more from self-employment in fishing during the qualifying period.\nTable 1 – Earnings needed to qualify for EI fishing benefits\nRegional rate of unemployment\nRequired earnings\n6% or less\n$4,200\n6.1% to 7%\n$4,000\n7.1% to 8%\n$3,800\n8.1% to 9%\n$3,600\n9.1% to 10%\n$3,400\n10.1% to 11%\n$3,200\n11.1% to 12%\n$2,900\n12.1% to 13%\n$2,700\n13.1% or more\n$2,500\nIf you've been paid EI benefits in the past and received a written notice for making a false statement or misrepresentation, you may need to earn more from fishing to claim fishing benefits.\nSpecial benefits\nSickness benefits\nIf you're sick, you may qualify for sickness benefits. The number of weeks of benefits you could receive depends on the date your claim begins:\nbefore December 18, 2022: up to 15 weeks\non or after December 18, 2022: up to 26 weeks New\nSickness benefits are available if you're ill, injured or in quarantine. You must obtain a medical certificate signed by a physician stating how long your incapacity due to illness, injury or quarantine is expected to last.\nMaternity benefits\nIf you’re away from work because you’re pregnant or recently gave birth, you may be able to receive up to 15 weeks of maternity benefits.\nParental benefits\nIf you’re a parent who is away from work to care for your newborn or newly adopted child, you may be able to receive parental benefits.\nThere are 2 options available for receiving parental benefits: standard or extended.\nUp to 40 weeks of standard parental benefits can be paid to parents sharing benefits, but 1 parent can't receive more than 35 weeks. If parents share benefits, they must choose the same option.\nUp to 69 weeks of extended parental benefits can be paid to parents sharing benefits, but 1 parent can't receive more than 61 weeks. If parents share benefits, they must choose the same option.\nCaregiving benefits\nCompassionate care benefits\nCompassionate care benefits can be paid for up to 26 weeks to fishers who have to be away from work to provide care or support to a person who has a serious medical condition with a significant risk of death within 26 weeks (6 months). Unemployed fishers receiving fishing benefits can also ask for this type of benefit. You must be able to provide medical proof that your family member has a serious medical condition with a risk of dying within 26 weeks and requires you to provide care and support to your family member who is seriously ill.\nFamily caregiver benefits\nFamily caregiver benefits for children can be paid for up to 35 weeks to family members who must be away from work to provide care or supportFootnote 1 to a critically ill or injured child who is under the age of 18.\nFamily caregiver benefits for adults can be paid for up to 15 weeks to family members who must be away from work to provide care or supportFootnote 1 to a critically ill or injured family member who is over the age of 18.\nYou must provide medical proof that the family member is critically ill or injured and requires you to provide care and support.\nFootnotes\nFootnote 1\nCare or support of a critically ill or injured child is defined as directly providing or participating in the care, or providing psychological and emotional support.\nReturn to footnote 1 referrer\nDocument navigation\nPrevious: What these benefits offer\nNext: How much you could receive\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-11-25"}, {"url": "https://www.canada.ca/en/revenue-agency/services/child-family-benefits/cai-payment/qualify-for-the-supplement.html", "text": "Find out if you qualify for the supplement for residents of small and rural communities\nThe climate action incentive payment includes a 10% supplement for residents of small and rural communities. The supplement applies only to residents of Alberta, Saskatchewan, Manitoba, and Ontario whose primary residence is outside a Census Metropolitan Area (CMA), and they expect to continue to reside outside the same CMA on April 1, 2022.\nFollow the steps below to find out if you qualify:\nIn the tables below, find the CMA closest to your primary residence.\nUse the corresponding list of municipalities and map to find your primary residence. You can zoom in to the map to view street address details.\nIf your primary residence is located:\noutside all listed municipalities or outside the shaded area of a map, you are considered to be residing outside a CMA and you do qualify for the supplement. Tick the box at line 60104 of Schedule 14.\nwithin a listed municipality or within the shaded area, you are considered to live within a CMA and you do not qualify for the supplement. Do not complete Schedule 14.\nIf you have any questions or difficulties, please call 1-800-959-8281.\nAlberta\nCMA and municipalities - Alberta\nCMA\nMunicipalities\nMap\nLethbridge\nLethbridge, Barons, Coaldale, Coalhurst, Lethbridge County, Nobleford, Picture Butte\nMap of Lethbridge Census Metropolitan Area\nCalgary\nCalgary, Airdrie, Beiseker, Chestermere, Cochrane, Crossfield, Irricana, Rocky View County, Tsuu T'ina Nation No. 145 (Sarcee 145)\nMap of Calgary Census Metropolitan Area\nEdmonton\nEdmonton, Alexander No. 134, Beaumont, Betula Beach, Bon Accord, Bruderheim, Calmar, Devon, Fort Saskatchewan, Gibbons, Golden Days, Itaska Beach, Kapasiwin, Lakeview, Leduc, Leduc County, Legal, Morinville, Parkland County, Point Alison, Redwater, Seba Beach, Spring Lake, Spruce Grove, St. Albert, Stony Plain, Stony Plain No. 135, Strathcona County, Sturgeon County, Sundance Beach, Thorsby, Wabamun, Wabamun No. 133A, Wabamun No. 133B, Warburg\nMap of Edmonton Census Metropolitan Area\nSaskatchewan\nCMA and municipalities - Saskatchewan\nCMA\nMunicipalities\nMap\nRegina\nRegina, Edenwold No. 158, White City, Pilot Butte, Lumsden No. 189, Lumsden, Balgonie, Lajord No. 128, Regina Beach, Sherwood No. 159, Grand Coulee, Buena Vista, Pense, Pense No. 160, Edenwold, Belle Plaine, Disley, Lumsden Beach\nMap of Regina Census Metropolitan Area\nSaskatoon\nSaskatoon, Warman, Martensville, Corman Park No. 344, Vanscoy No. 345, Dundurn No. 314, Blucher No. 343, Dalmeny, Langham, Aberdeen No. 373, Osler, Delisle, Allan, Asquith, Aberdeen, Dundurn, Vanscoy, Colonsay, Whitecap, Clavet, Shields, Colonsay No. 342, Bradwell, Thode, Meacham\nMap of Saskatoon Census Metropolitan Area\nManitoba\nCMA and municipalities - Manitoba\nCMA\nMunicipalities\nMap\nWinnipeg\nWinnipeg, Springfield, Taché, St. Clements, East St. Paul, Macdonald, Ritchot, West St. Paul, Headingley, St. François Xavier, Rosser, Brokenhead 4\nMap of Winnipeg Census Metropolitan Area\nOntario\nCMA and municipalities - Ontario\nCMA\nMunicipalities\nMap\nOttawa - Gatineau (Ontario part)\nOttawa, Clarence-Rockland, Russell, North Grenville\nMap of Ottawa - Gatineau  Census Metropolitan Area (Ontario part)\nKingston\nKingston, South Frontenac, Loyalist, Frontenac Islands\nMap of Kingston Census Metropolitan Area\nBelleville\nBelleville, Quinte West, Stirling-Rawdon, Tyendinaga\nMap of Belleville Census Metropolitan Area\nPeterborough\nPeterborough, Selwyn, Cavan Monaghan, Douro-Dummer, Otonabee-South Monaghan, Curve Lake First Nation 35, Hiawatha First Nation\nMap of Peterborough Census Metropolitan Area\nOshawa\nOshawa, Whitby, Clarington\nMap of Oshawa Census Metropolitan Area\nToronto\nToronto, Mississauga, Brampton, Markham, Vaughan, Richmond Hill, Oakville, Ajax, Milton, Pickering, Newmarket, Caledon, Halton Hills, Aurora, Whitchurch-Stouffville, Georgina, Bradford West Gwillimbury, New Tecumseth, Orangeville, King, East Gwillimbury, Uxbridge, Mono, Chippewas of Georgina Island First Nation\nMap of Toronto Census Metropolitan Area\nHamilton\nHamilton, Burlington, Grimsby\nMap of Hamilton Census Metropolitan Area\nSt. Catharines - Niagara\nSt. Catharines, Niagara Falls, Welland, Fort Erie, Lincoln, Thorold, Port Colborne, Niagara-on-the-Lake, Pelham, Wainfleet\nMap of St. Catharines - Niagara Census Metropolitan Area\nKitchener - Cambridge - Waterloo\nKitchener, Cambridge, Waterloo, Woolwich, Wilmot, North Dumfries\nMap of Kitchener - Cambridge - Waterloo Census Metropolitan Area\nBrantford\nBrantford, Brant, Six Nations (Part) 40\nMap of Brantford Census Metropolitan Area\nGuelph\nGuelph, Guelph/Eramosa, Puslinch\nMap of Guelph Census Metropolitan Area\nLondon\nLondon, St. Thomas, Strathroy-Caradoc, Middlesex Centre, Thames Centre, Central Elgin, Southwold, Adelaide-Metcalfe\nMap of London Census Metropolitan Area\nWindsor\nWindsor, Lakeshore, LaSalle, Tecumseh, Amherstburg\nMap of Windsor Census Metropolitan Area\nBarrie\nBarrie, Innisfil, Springwater\nMap of Barrie Census Metropolitan Area\nGreater Sudbury / Grand Sudbury\nGreater Sudbury / Grand Sudbury, Markstay-Warren, Whitefish Lake 6, Wahnapitei 11\nMap of Greater Sudbury / Grand Sudbury Census Metropolitan Area\nThunder Bay\nThunder Bay, Oliver Paipoonge, Shuniah, Neebing, Fort William 52, Conmee, O'Connor, Gillies\nMap of Thunder Bay Census Metropolitan Area\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-01-18"}, {"url": "https://www.canada.ca/en/services/benefits/ei/ei-maternity-parental/eligibility.html", "text": "EI maternity and parental benefits: Eligibility\nEI maternity and parental benefits\nWhat these benefits offer What these benefits offer\nDo you qualify\nHow much you could receive How much you could receive\nApply Apply\nAfter you apply After you apply\nSpecial circumstances Special circumstances\nDo you qualify\nThe information below should be used as a guideline. We encourage you to apply for benefits as soon as possible and let us determine if you're eligible.\nYou need to demonstrate that:\nyou're pregnant or have recently given birth when requesting maternity benefits\nyou're a parent caring for your newborn or newly adopted child when requesting parental benefits\nyour regular weekly earnings from work have decreased by more than 40% for at least 1 week\nyou accumulated 600 insured hours of work in the 52 weeks before the start of your claim or since the start of your last claim, whichever is shorter\nIf you had a recent claim\nIf you received Employment Insurance benefits in the past 52 weeks, you may not be eligible to receive the maximum number of weeks of maternity or parental benefits.\nHowever, if you've worked enough hours since your last claim, you may be able to start a new claim. Contact us to find out what's best for your situation.\nIf you get sick or require bedrest during pregnancy\nIf you have health complications during pregnancy, you could be eligible for sickness benefits or for maternity benefits earlier. You must meet the conditions for each benefit.\nIf you're not a Canadian citizen\nIf you have a valid social insurance number, you may be eligible for maternity and parental benefits.\nIf you plan to travel outside of Canada, contact Immigration, Refugees and Citizenship Canada to find out how this may impact your situation.\nEligibility period\nMaternity benefits\nYou can start receiving maternity benefits as early as 12 weeks before your due date or the date you give birth. You can't receive these benefits more than 17 weeks after your due date or the date you gave birth, whichever is later.\nParental benefits\nYou must take parental benefits within specific periods starting the week of your child's date of birth or the week your child is placed with you for the purpose of adoption.\nThese periods are:\nStandard parental: within 52 weeks (12 months)\nExtended parental: within 78 weeks (18 months)\nDocument navigation\nPrevious What these benefits offer\nNext How much you could receive\nReport a problem or mistake on this page\nPlease select all that apply:\nA link, button or video is not working\nIt has a spelling mistake\nInformation is missing\nInformation is outdated or wrong\nLogin error when trying to access an account\nI can't find what I'm looking for\nOther issue not in this list\nSubmit\nThank you for your help!\nYou will not receive a reply. For enquiries, contact us.\nDate modified:\n2022-11-25"}, {"url": "https://www.canada.ca/en/services/taxes/child-and-family-benefits/top-up-canada-housing-benefit/who-apply/what-eligible-rent.html", "text": "What is eligible rent - One-time top-up to the Canada Housing Benefit\nOne-time top-up to the Canada Housing Benefit\nWho can apply Who can apply\nWhat is eligible rent\nEstimate your income and rent Estimate your income and rent\nGet ready to apply Get ready to apply\nHow to apply How to apply\nAfter you apply After you apply\nContact the CRA Contact the CRA\nWhat is eligible rent\nRent that is eligible for the one-time top-up to the Canada Housing Benefit refers to payments you made in 2022 under a lease, licence or similar arrangement to occupy a principal residence in Canada in 2022.\nWhat is a principal residence\nFor this benefit, your principal residence is the place where you normally live and pay rent.\nThis can be any abode, dwelling or other place rented. Examples of principal residence include a house, cottage, condominium, apartment in an apartment building, apartment in a duplex, college or university residence, trailer, mobile home, or houseboat.\nGenerally, you can only have one principal residence at a time, unless you're living apart from a spouse or common-law partner.\nOn this page\nWhat is not included in rent\nIf your marital status changed in 2022\nIf you lived apart from your spouse or common-law partner\nIf you moved\nIf you shared rent\nIf you lived in a mobile home\nWhat is not included in rent\nMeals, board or other services\nDo not include any payment that is specified on the lease for meals, board or other services.\nIf the rent you paid includes an amount for meals, board or other services, but the portion of rent that goes towards these services is not specified on the lease, include only 90% of the total amount of rent you paid.\nUtilities and taxes that are not part of the rental agreement\nPayments for utilities or property taxes are not included if they were either:\nnot part of the rental agreement\npaid to a person or entity who was not a party to the lease, licence or arrangement\nBusiness expense deductions\nAny payments that were deducted as a business expense are not eligible rent amounts.\nRent for capital lease type arrangements\nAny payments of rent to own or other capital lease type arrangements, where all or a portion of the rent goes towards the purchase of the property, are not eligible rent amounts.\nRent paid to a parent or another relative\nIf you paid rent to a parent or another relative, only include this as rent if the payment would be considered by the CRA as rental income for tax purposes for the parent or relative who received it.\nIf your marital status changed in 2022\nIf you got married in 2022\nBefore or on December 1, 2022:\nIf you got married in 2022 before or on December 1, 2022, only one spouse is eligible to receive the one-time payment. If you are the spouse who applies:\ninclude rent you paid in 2022 before you were married\ninclude rent your spouse paid in 2022 before you were married\ninclude rent you paid as a married couple in 2022\nAfter December 1, 2022:\nIf you got married in 2022 after December 1, 2022, your marital status remains, for the purpose of this benefit, as it was prior to you getting married. This means, if you were single or widowed and you got married after December 1, 2022, then you would still be considered as single or widowed for this benefit.\nIn your application:\ninclude the total amount of rent you paid in 2022 up to the day before you got married\ninclude your portion of the total amount of rent paid in 2022 by you and your cohabiting spouse or common-law partner from the day you got married\nIf you got separated or divorced in 2022\nSeparation is when a married or common-law couple lives apart more than 90 days, due to a breakdown in their relationship. To be considered separated for this benefit and apply individually, you must have been separated before December 1, 2022 and 90 days must have passed since the separation before you submit your application.\nBefore or on December 1, 2022:\nIf you got separated or divorced in 2022 before or on December 1, 2022, each spouse or common-law partner is eligible to receive the one-time payment after 90 days have passed since the separation.\nIn your application:\ninclude your portion of the total amount of rent paid in 2022 by you and your cohabiting spouse or common-law partner up to the day before you started living separate and apart\ninclude the total amount of rent you paid in 2022 starting on the first day you were living separate and apart\nIn your former spouse’s or common-law partner’s application, they would:\ninclude their portion of the total amount of rent paid in 2022 by you and your cohabiting spouse or common-law partner up to the day before you started living separate and apart\ninclude the total amount of rent they paid in 2022 starting on the first day you were living separate and apart\nIf you have separated due to a breakdown in your relationship but you have not yet been separated for a period of at least 90 days, you will need to wait until 90 days have passed before you will be able to apply for this benefit as an individual.\nAfter December 1, 2022:\nIf you got separated or divorced in 2022 after December 1, 2022, your marital status remains, for the purpose of this benefit, as it was prior to you getting separated or divorced. This means you would still be considered married for this benefit.\nOnly one spouse or common-law partner is eligible to receive the one-time payment. If both you and your spouse or common-law partner apply, the first one to apply will receive the benefit.\nIf you apply:\ninclude rent you paid as a married couple in 2022\ninclude rent you paid in 2022 after you were separated or divorced\ninclude rent your former spouse paid in 2022 after you were separated or divorced\nIf you became widowed in 2022\nIf you became widowed in 2022, do the following in your application:\ninclude the total amount of rent paid in 2022 by you and your cohabiting spouse or common-law partner up to the day before you became widowed\ninclude the total amount of rent you paid in 2022 starting on the first day you became widowed\nIf you lived apart from your spouse or common-law partner\nIf you lived in two principal residences due to physical separation\nYou and your spouse or common-law partner might live in two principal residences due to physical separation (for example, one spouse goes away to school or one common-law partner is away for work purposes).\nIf you and your spouse or common-law partner lived in two different principal residences at any point in 2022, and living apart was not due to a breakdown in the relationship, only one spouse or common-law partner is eligible to receive the one-time payment. If you are the spouse or common-law partner who applies:\ninclude the total amount of rent paid in 2022 for both principal residences, regardless of which spouse or common-law partner paid the rent\nIf you lived apart due to a breakdown in your relationship\nIf, due to a breakdown in the relationship, you and your spouse or common-law partner lived apart at least 90 days, you are considered separated by the CRA. Determine your rent if your marital status changed in 2022.\nIf you moved\nIf you moved during 2022, include eligible rent paid in 2022 for all principal residences you lived in during 2022 for the time that they were your primary residence.\nIf you shared rent\nIn the case of rent payments shared by multiple families or individuals (roommates) living at the same address, even if only one individual was making the payments to the landlord, you would:\neach apply as separate family units or individuals\neach enter the portion of the rent that you paid\nIf you paid rent to a parent or another relative.\nIf you lived in a mobile home\nEligible rent includes lot rental fees for your principal residence, such as for a mobile home. Lot rental fees must be under a lease, licence or similar arrangement to qualify as rent.\nDocument navigation\nNext: Get ready to apply\nDid you find what you were looking for?\nYes No\nIf not, tell us why:\nWhat was wrong?\nI can't find the information\nThe information is hard to understand\nThere was an error or something didn't work\nOther reason\nPlease provide more details\nYou will not receive a reply. Telephone numbers and email addresses will be removed.\nMaximum 300 characters\nSubmit\nThank you for your feedback\nDate modified:\n2022-12-12"}]